[
  {
    "key":"PZV38HDT",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2014,
    "author_names":"Rohit Ashok Khot;Larissa Hjorth;Florian Floyd Mueller",
    "affiliations":"RMIT University",
    "title":"Understanding physical activity through 3D printed material artifacts",
    "keywords":[
      "3D printing",
      "Digital fabrication",
      "Entertainment",
      "Personal informatics",
      "Physical exercise",
      "Quantifiable self"
    ],
    "abstract":"In this paper, we advocate a novel approach of representing physical activity in the form of material artifacts. By designing such material representations, we aim to understand what these artifacts might offer in terms of reflecting upon physical activity. For example, what types of affect do material artifacts, representing ones' physical activity create for the user? In order to advance this understanding, we designed a system called SweatAtoms that transforms the physical activity data based on heart rate into 3D printed material artifacts. We conducted an \"in the wild study\" by deploying our system in six households where participants were experiencing five different material representations of their physical activity for a period of two weeks each. We found that the material artifacts made participants more conscious about their involvement in physical activity and illustrated different levels of engagement with the artifacts. Along with reporting the gained insights from the deployments, we offer reflections on designing material representations for physical activity. We hope that our work will inspire designers to consider new possibilities afforded by digital fabrication to support user's experience with physical activity by utilizing interactive technologies at our disposal.",
    "doi":"10.1145\/2556288.2557144",
    "outer_cite_count":56.0
  },
  {
    "key":"73GX5YN5",
    "publication_name":"2016 IEEE International Conference on Pervasive Computing and Communication Workshops, PerCom Workshops 2016",
    "year":2016,
    "author_names":"Lu Bai;Christos Efstratiou;Chee Siang Ang",
    "affiliations":"University of Kent",
    "title":"WeSport: Utilising wrist-band sensing to detect player activities in basketball games",
    "keywords":[
      "Accelerometer",
      "Activity monitoring",
      "Classification",
      "Wearable Sensors"
    ],
    "abstract":"© 2016 IEEE. Wristbands have been traditionally designed to track the activities of a single person. However there is an opportunity to utilize the sensing capabilities of wristbands to offer activity tracking services within the domain of team-based sports games. In this paper we demonstrate the design of an activity tracking system capable of detecting the players' activities within a one-to-one basketball game. Relying on the inertial sensors of wristbands and smartphones, the system can capture the shooting attempts of each player and provide statistics about their performance. The system is based on a two-level classification architecture, combining data from both players in the game. We employ a technique for semi-automatic labeling of the ground truth that requires minimum manual input during a training game. Using a single game as a training dataset, and applying the classifier on future games we demonstrate that the system can achieve a good level of accuracy detecting the shooting attempts of both players in the game (precision 91.34%, recall 94.31%).",
    "doi":"10.1109\/PERCOMW.2016.7457167",
    "outer_cite_count":10.0
  },
  {
    "key":"DACL8AFT",
    "publication_name":"Journal of Orthopaedic and Sports Physical Therapy",
    "year":2010,
    "author_names":"Harrison Philip Crowell;Clare E. Milnert;Joseph Hamill;Irene S. Davis",
    "affiliations":"U.S. Army Research Laboratory;University of Delaware;The University of Tennessee, Knoxville;University of Massachusetts Amherst;Drayer Physical Therapy Institute",
    "title":"Reducing impact loading during running with the use of real-time visual feedback",
    "keywords":[
      "Accelerometer",
      "Gait retraining",
      "Ground reaction forces",
      "Stress fracture",
      "Tibia"
    ],
    "abstract":"STUDY DESIGN: Single-subject with repeated measures. OBJECTIVES: To determine if runners can use real-time visual feedback from an accelerometer to achieve immediate reductions in tibial acceleration and vertical-force loading rates. BACKGROROUND: Stress fractures are a common injury among runners. Previous studies suggest that runners with higher than normal tibial acceleration and vertical-force loading rates are at increased risk for tibial stress fractures. If these runners can be trained to reduce the loading on their lower extremities, it may reduce their risk of stress fractures. METHODS: Five subjects participated in this study. All subjects ran on a treadmill, instrumented with force transducers, during a single 30-minute session that was divided into warm-up, feedback, no-feedback, and cool-down periods. During running, the subjects also wore an accelerometer taped to their distal right tibia. Peak positive acceleration of the tibia, vertical force impact peak, and average and instantaneous vertical-force loading rates were assessed at the end of the warm-up, feedback, and no-feedback periods. RESULTS: Single-subject analysis revealed that 4 of the 5 subjects had significant reductions in their peak positive acceleration at the end of the no-feedback period compared to the warm-up. In addition, all of the subjects had significant decreases in impact peak and vertical ground reaction force loading rates at the end of the no-feedback period. CONCLUSION: In a single session of training with real-time visual feedback, it appears that most runners can reduce the types of lower extremity loading associated with stress fractures. This may lead to training programs that reduce the risk of stress fractures for runners. LEVELLEVEL OF EVIEVIDENCE: Prevention, level 5.",
    "doi":"10.2519\/jospt.2010.3166",
    "outer_cite_count":102.0
  },
  {
    "key":"KFXT4A3H",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2008,
    "author_names":"Sunny Consolvo;David W. McDonald;Tammy Toscos;Mike Y. Chen;Jon Froehlich;Beverly Harrison;Predrag Klasnja;Anthony LaMarea;Louis LeGrand;Ryan Libby;Ian Smith;James A. Landay",
    "affiliations":"Intel Research Laboratories;University of Washington, Seattle",
    "title":"Activity sensing in the wild: A field trial of UbiFit Garden",
    "keywords":[
      "Activity inference",
      "Activity-based applications",
      "Ambient display",
      "Fitness",
      "Mobile phone",
      "Persuasive technology",
      "Sensing"
    ],
    "abstract":"Recent advances in small inexpensive sensors, low-power processing, and activity modeling have enabled applications that use on-body sensing and machine learning to infer people's activities throughout everyday life. To address the growing rate of sedentary lifestyles, we have developed a system, UbiFit Garden, which uses these technologies and a personal, mobile display to encourage physical activity. We conducted a 3-week field trial in which 12 participants used the system and report findings focusing on their experiences with the sensing and activity inference. We discuss key implications for systems that use on-body sensing and activity inference to encourage physical activity. Copyright 2008 ACM.",
    "doi":"10.1145\/1357054.1357335",
    "outer_cite_count":668.0
  },
  {
    "key":"K73P7V8F",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2015,
    "author_names":"Moon Hwan Lee;Seijin Cha;Tek Jin Nam",
    "affiliations":"Korea Advanced Institute of Science &amp; Technology",
    "title":"Patina engraver: Visualizing activity logs as patina in fashionable trackers",
    "keywords":[
      "Activity tracker",
      "Digital fabrication",
      "Fashion",
      "Patina"
    ],
    "abstract":"© Copyright 2015 ACM. Despite technological improvements in commercial activity trackers, little attention has been given to their emotional, social, or fashion-related qualities, such as their visual aesthetics and their relationship to self-expression and social connection. As an alternative integrated approach incorporating HCI, fashion, and product design, our project made use of the characteristics of patina to improve activity trackers as fashionable wearables. We developed the Patina Engraving System, which engraves patina-like patterns on an activity tracker according to a user's activity logs. Using a piercing technique, the patina of activity logs has been made abstract, visually rich, gradually emerging, and historically accumulated. During the field trial, we found that the patina motivated the participants to increase exercises for engraving aesthetic patinas. A tracker with patina triggered spontaneous social interactions in face-to-face situations. The participants also cherished the trackers that held their own history. Based on the field trial, we discuss design implications for utilizing patina in designing future fashionable technologies.",
    "doi":"10.1145\/2702123.2702213",
    "outer_cite_count":19.0
  },
  {
    "key":"G92UJP2H",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2015,
    "author_names":"Jo Wood",
    "affiliations":"City, University of London",
    "title":"Visualizing Personal Progress in Participatory Sports Cycling Events",
    "keywords":[
      "affective computing",
      "computer graphics",
      "Graphics design study",
      "personal visualization",
      "sports data"
    ],
    "abstract":"© 1981-2012 IEEE. This article explores the potential for creating personal visualization of participation in sports cycling as a design study. Examples show riders' personal narratives and performances relative to other participants in long-distance cycling events. Minimalist cartographic design is applied during the automatic generation of profile maps, which allows personal textual narratives to be attached to visualizations of 3D variations in terrain. Changes in relative position and time-in-hand data during mass participation events are shown as position charts, and animations of rider density over time are used to visualize the progress of larger groups of riders in an event. The designs focus on representing the aspects of participation that evoke an emotional response in an effort to engage users.",
    "doi":"10.1109\/MCG.2015.71",
    "outer_cite_count":8.0
  },
  {
    "key":"5H7FP4QT",
    "publication_name":"Journal of Visualization",
    "year":2016,
    "author_names":"Wentao Wang;Jiawan Zhang;Xiaoru Yuan;Shixia Liu",
    "affiliations":"Tsinghua University;Tianjin University;Peking University",
    "title":"MatchOrchestra: a generalized visual analytics for competitive team sports",
    "keywords":[
      "Analytical reasoning",
      "Competitive sports",
      "Musical metaphor"
    ],
    "abstract":"© 2015, The Visualization Society of Japan. Competitive sports analysis is a popular and valuable research topic in recent years. Sports are competitive, fast paced, and teamwork based. In this article, we introduce a generalized and effective system MatchOrchestra to analyze competitive team sports based on musical score and orchestra metaphor. MatchOrchestra provides views about player performance, team status, match tempo, player cooperation and confrontation, which can help analysts in performing specific analysis tasks. To demonstrate the usability of our proposed system, representative case studies were conducted on an NBA (National Basketball Association) game and also extend to apply in football match, which are both typical competitive sports matches.",
    "doi":"10.1007\/s12650-015-0337-3",
    "outer_cite_count":2.0
  },
  {
    "key":"U9XCD1VU",
    "publication_name":"Proceedings of the International Conference on Information Visualisation",
    "year":2011,
    "author_names":"Adrian Rusu;Doru Stoica;Edward Burns",
    "affiliations":"Rowan University;University of Craiova",
    "title":"Analyzing soccer goalkeeper performance using a metaphor-based visualization",
    "keywords":[
      "athletics",
      "glyph",
      "metaphor-based visualization"
    ],
    "abstract":"The dimensionality of soccer statistics relating to goalkeeper specific data can be difficult to interpret. Leveraging our existing statistical analytics tool, Soccer Scoop, we developed a goalkeeper visualization add-on that can assist a team manager. With the newly developed goalkeeper visualization tool, a team manager can compare a single goalkeeper between two games, measure the overall performance of the goalkeeper both for games played at home or away, as well as to devise the appropriate training exercises needed to strengthen any visible weakness. To keep with the continuity of the visualization styles of our first tool, Soccer Scoop, the goalkeeper visualization applies similar techniques, such as glyphs, details on demand, color, and Gestalt principles. © 2011 IEEE.",
    "doi":"10.1109\/IV.2011.57",
    "outer_cite_count":10.0
  },
  {
    "key":"AIWUZMH8",
    "publication_name":"Computational Visual Media",
    "year":2016,
    "author_names":"L. Sousa;R. Alves;J. M.F. Rodrigues",
    "affiliations":"Universidade do Algarve",
    "title":"Augmented reality system to assist inexperienced pool players",
    "keywords":[
      "augmented reality",
      "computer vision",
      "Kinect",
      "pool game"
    ],
    "abstract":"© 2016, The Author(s). Pool and billiards are amongst a family of games played on a table with six pockets along the rails. This paper presents an augmented reality tool designed to assist unskilled or amateur players of such games. The system is based on a projector and a Kinect 2 sensor placed above the table, acquiring and processing the game on-the-fly. By using depth information and detecting the table’s rails (borders), the balls’ positions, the cue direction, and the strike of the ball, computations predict the resulting balls’ trajectories after the shot is played. These results—trajectories, visual effects, and menus—are visually output by the projector, making them visible on the snooker table. The system achieves a shot prediction accuracy of 98% when no bouncing occurs.",
    "doi":"10.1007\/s41095-016-0047-3",
    "outer_cite_count":4.0
  },
  {
    "key":"FCZ1EYC3",
    "publication_name":"Annals of Applied Statistics",
    "year":2015,
    "author_names":"Alexander Franks;Andrew Miller;Luke Bornn;Kirk Goldsberry",
    "affiliations":"Harvard University",
    "title":"Characterizing the spatial structure of defensive skill in professional basketball",
    "keywords":[
      "Basketball",
      "Bayesian hierarchical models",
      "Hidden markov models",
      "Nonnegative matrix factorization"
    ],
    "abstract":"© Institute of Mathematical Statistics, 2015. Although basketball is a dualistic sport, with all players competing on both offense and defense, almost all of the sport’s conventionalmetrics are designed to summarize offensive play. As a result, player valuations are largely based on offensive performances and to a much lesser degree on defensive ones. Steals, blocks and defensive rebounds provide only a limited summary of defensive effectiveness, yet they persist because they summarize salient events that are easy to observe. Due to the inefficacy of traditional defensive statistics, the state of the art in defensive analytics remains qualitative, based on expert intuition and analysis that can be prone to human biases and imprecision. Fortunately, emerging optical player tracking systems have the potential to enable a richer quantitative characterization of basketball performance, particularly defensive performance. Unfortunately, due to computational and methodological complexities, that potential remains unmet. This paper attempts to fill this void, combining spatial and spatio-temporal processes, matrix factorization techniques and hierarchical regression models with player tracking data to advance the state of defensive analytics in the NBA. Our approach detects, characterizes and quantifies multiple aspects of defensive play in basketball, supporting some common understandings of defensive effectiveness, challenging others and opening up many new insights into the defensive elements of basketball.",
    "doi":"10.1214\/14-AOAS799",
    "outer_cite_count":27.0
  },
  {
    "key":"4WUGLDGY",
    "publication_name":"UbiComp 2013 - Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing",
    "year":2013,
    "author_names":"Alan Chatham;Florian Floyd Mueller",
    "affiliations":"RMIT University",
    "title":"Adding an interactive display to a public basketball hoop can motivate players and foster community",
    "keywords":[
      "Basketball",
      "Public display",
      "Public game space",
      "Urban screens"
    ],
    "abstract":"Interactive displays that aim to engage people through play have been successfully deployed in urban environments. However, there has been little work bringing interactive displays into existing public game spaces like outdoor basketball courts. To explore this, we designed an interactive display for a public half-court basketball hoop. We studied the impact of 3 different display modes over a 10-week period through interviews with players, spectators, and passers-by. Our findings suggest 3 dimensions for the design space of such interactive displays: balancing notice ability across different user groups, support for different play action, and support for connecting user groups. We also present 6 design tactics along these dimensions to help designers create engaging interactive displays for public game spaces. Copyright © 2013 ACM.",
    "doi":"10.1145\/2493432.2493518",
    "outer_cite_count":9.0
  },
  {
    "key":"BCD80P8P",
    "publication_name":"IEEE Transactions on Multimedia",
    "year":2016,
    "author_names":"Wei Chen;Tianyi Lao;Jing Xia;Xinxin Huang;Biao Zhu;Wanqi Hu;Huihua Guan",
    "affiliations":"State Key Lab of CAD&amp;CG, Zhejiang University",
    "title":"GameFlow: Narrative Visualization of NBA Basketball Games",
    "keywords":[
      "Basketball games",
      "game narration",
      "video",
      "visualization"
    ],
    "abstract":"© 2016 IEEE. Although basketball games have received broad attention, the forms of game reports and webcast are purely content-based cross-media: texts, videos, snapshots, and performance figures. Analytical narrations of games that seek to compose a complete game from heterogeneous datasets are challenging for general media producers because such a composition is time-consuming and heavily depends on domain experts. In particular, an appropriate analytical commentary of basketball games requires two factors, namely, rich context and domain knowledge, which includes game events, player locations, player profiles, and team profiles, among others. This type of analytical commentary elicits a timely and effective basketball game data visualization made up of different sources of media. Existing visualizations of basketball games mainly profile a particular aspect of the game. Therefore, this paper presents an expressive visualization scheme that comprehensively illustrates NBA games with three levels of details: a season level, a game level, and a session level. We reorganize a basketball game as a sequence of sessions to depict the game states and heated confrontations. We design and implement a live system that integrates multimedia NBA datasets: play-by-play text data, box score data, game video data, and action area data. We demonstrate the effectiveness of this scheme with case studies and user feedbacks.",
    "doi":"10.1109\/TMM.2016.2614221",
    "outer_cite_count":18.0
  },
  {
    "key":"L869UGP2",
    "publication_name":"Transportation Research Part C: Emerging Technologies",
    "year":2014,
    "author_names":"Roger Beecham;Jo Wood",
    "affiliations":"City, University of London",
    "title":"Characterising group-cycling journeys using interactive graphics",
    "keywords":[
      "Bicycling behaviour",
      "Bikeshare schemes",
      "Visual analytics"
    ],
    "abstract":"© 2014 Elsevier Ltd. The group-cycling behaviours of over 16,000 members of the London Cycle Hire Scheme (LCHS), a large public bikeshare system, are identified and analysed. Group journeys are defined as trips made by two or more cyclists together in space and time. Detailed insights into group-cycling behaviour are generated using specifically designed visualization software. We find that in many respects group-cycle journeys fit an expected pattern of discretionary activity: group journeys are more likely at weekends, late evenings and lunchtimes; they generally take place within more pleasant parts of the city; and between individuals apparently known to each other. A separate set of group activity is found, however, that coincides with commuting peaks and that appears to be imposed onto LCHS users by the scheme's design. Studying the characteristics of individuals making group journeys, we identify a group of less experienced LCHS cyclists that appear to make more spatially extensive journeys than they would do normally while cycling with others; and that female cyclists are more likely to make late evening journeys when cycling in groups. For 20% of group cyclists, the first journey ever made through the LCHS was a group journey; this is particularly surprising since just 9% of all group cyclists' journeys are group journeys. Moreover, we find that women are very significantly (. p<. 0.001) overrepresented amongst these 'first time group cyclists'. Studying the bikeshare cyclists, or bike share 'friends', that individuals make 'first time group journeys' with, we find a significantly high incidence (. p<. 0.001) of group journeys being made with friends of the opposite gender, and for a very large proportion (55%) of members these first ever journeys are made with a friend that shares the same postcode. A substantial insight, then, is that group cycling appears to be a means through which early LCHS usage is initiated.",
    "doi":"10.1016\/j.trc.2014.03.007",
    "outer_cite_count":19.0
  },
  {
    "key":"5U90ZMEC",
    "publication_name":"TEI 2014 - 8th International Conference on Tangible, Embedded and Embodied Interaction, Proceedings",
    "year":2014,
    "author_names":"Wouter Walmink;Danielle Wilde;Florian Floyd Mueller",
    "affiliations":"RMIT University",
    "title":"Displaying heart rate data on a bicycle helmet to support social exertion experiences",
    "keywords":[
      "Biofeedback",
      "Body-worn technologies",
      "Cycling",
      "Exertion",
      "Heart rate",
      "Helmet",
      "Wearables"
    ],
    "abstract":"People often engage in physical activity with others, yet wearable technologies like heart rate monitors typically focus on individual usage. In response, we discuss the potential of heart rate displays in a social context, by means of an augmented cycling helmet that displays heart rate data. We studied how pairs of cyclists engaged with this setup and found that access to another person's heart rate data can result in social interplay which in turn supports engagement with the exertion activity. Through our design process and study, we reveal key dimensions of designing for social uses of heart rate data and wearable displays: temporal and spatial accessibility of data, technology support for its interpretation, and influences on heart rate. We also articulate a set of insights for designers that aim to support social exertion activities with heart rate data. As such, our work expands our understanding of wearable technologies' unique interaction opportunities. Copyright is held by the owner\/author(s).",
    "doi":"10.1145\/2540930.2540970",
    "outer_cite_count":47.0
  },
  {
    "key":"HEF0RQND",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2012,
    "author_names":"Anthony Tang;Sebastian Boring",
    "affiliations":"University of Calgary",
    "title":"EpicPlay: Crowd-sourcing sports video highlights",
    "keywords":[
      "Broadcast sports",
      "Crowd-sourcing",
      "Microblogging",
      "Sports",
      "Twitter",
      "Video annotation",
      "Video summarization"
    ],
    "abstract":"During a live sports event, many sports fans use social media as a part of their viewing experience, reporting on their thoughts on the event as it unfolds. In this work, we use this information stream to semantically annotate live broadcast sports games, using these annotations to select video highlights from the game. We demonstrate that this approach can be used to select highlights specific for fans of each team, and that these clips reflect the emotions of a fan during a game. Further, we describe how these clips differ from those seen on nightly sportscasts. Copyright 2012 ACM.",
    "doi":"10.1145\/2207676.2208622",
    "outer_cite_count":30.0
  },
  {
    "key":"O9WKDWIO",
    "publication_name":"Multimedia Systems",
    "year":2016,
    "author_names":"Chun Chieh Hsu;Hua Tsung Chen;Chien Li Chou;Suh Yin Lee",
    "affiliations":"National Chiao Tung University Taiwan",
    "title":"2D Histogram-based player localization in broadcast volleyball videos",
    "keywords":[
      "Broadcast volleyball video",
      "Camera calibration",
      "Multimedia system",
      "Pattern recognition",
      "People localization",
      "Sports video analysis"
    ],
    "abstract":"© 2015, Springer-Verlag Berlin Heidelberg. Player location is one of the most informative cues for obtaining tactics arrangement and collecting descriptive game statistics. However, state-of-the-art supervised learning-based methods for player localization require a large amount of labeled training data. Hence, the development of automatic systems for player localization becomes indispensable. Volleyball games reach a huge audience base and contain a variety of tactical strategies, necessitating the implementation of systems for inferring tactics and analyzing formations automatically. Therefore, a novel 2D histogram-based player localization method capable of locating players with occlusions is developed and presented in this paper. The proposed system is able to automatically detect the court lines for camera calibration, extract players by calculating both x and y histograms of extracted player masks, and visualize the team formations on real-world court model. The experiments on broadcast volleyball videos demonstrate efficient and effective results against a traditional object segmentation method (connected component analysis) and a supervised learning approach utilizing histogram of oriented gradient features.",
    "doi":"10.1007\/s00530-015-0463-8",
    "outer_cite_count":4.0
  },
  {
    "key":"WS94UAMD",
    "publication_name":"Proceedings of the IEEE International Conference on Computer Vision",
    "year":2016,
    "author_names":"Fabricio Batista Narcizo;Dan Witzner Hansen",
    "affiliations":"IT-Universitetet i København",
    "title":"Depth Compensation Model for Gaze Estimation in Sport Analysis",
    "keywords":[
      "Calibration",
      "Cameras",
      "Estimation",
      "Gaze tracking",
      "Geometry",
      "Training",
      "Transmission line matrix methods"
    ],
    "abstract":"© 2015 IEEE. A depth compensation model is presented as a novel approach to reduce the effects of parallax error for head-mounted eye trackers. The method can reduce the parallax error when the distance between the user and the target is prior known. The model is geometrically presented and its performance is tested in a totally controlled environment with aim to check the influences of eye tracker parameters and ocular biometric parameters on its behavior. We also present a gaze estimation method based on epipolar geometry for binocular eye tracking setups. The depth compensation model has shown very promising to the field of eye tracking. It can reduce 10 times less the influence of parallax error in multiple depth planes.",
    "doi":"10.1109\/ICCVW.2015.107",
    "outer_cite_count":5.0
  },
  {
    "key":"G6Z8KF9Z",
    "publication_name":"IEEE Transactions on Visualization and Computer Graphics",
    "year":2012,
    "author_names":"Brian Bowman;Niklas Elmqvist;T. J. Jankun-Kelly",
    "affiliations":"Purdue University;Bagley College of Engineering",
    "title":"Toward visualization for games: Theory, design space, and patterns",
    "keywords":[
      "Computer games",
      "entertainment",
      "game analytics",
      "interactive entertainment",
      "video games",
      "visualization"
    ],
    "abstract":"Electronic games are starting to incorporate in-game telemetry that collects data about player, team, and community performance on a massive scale, and as data begins to accumulate, so does the demand for effectively analyzing this data. In this paper, we use examples from both old and new games of different genres to explore the theory and design space of visualization for games. Drawing on these examples, we define a design space for this novel research topic and use it to formulate design patterns for how to best apply visualization technology to games. We then discuss the implications that this new framework will potentially have on the design and development of game and visualization technology in the future. © 1995-2012 IEEE.",
    "doi":"10.1109\/TVCG.2012.77",
    "outer_cite_count":34.0
  },
  {
    "key":"SK53KNN3",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Antonio G. Losada;Roberto Theron;Alejandro Benito",
    "affiliations":"Universidad de Salamanca",
    "title":"BKViz: A basketball visual analysis tool",
    "keywords":[
      "computer graphics",
      "data visualization",
      "interactive visualizations",
      "sport analytics",
      "visual analytics"
    ],
    "abstract":"© 1981-2012 IEEE. The amount of data available in the sports field is difficult for coaches, analysts, and players to comprehend using classic analytics methods. Thus, new methods are necessary to help users break down that information and analyze it at a deeper level. The BKViz visual analytics system focuses on individual basketball games using classic and novel methods to reveal how players perform together and as individuals. The information is presented in interactive visualizations that allow immediate user feedback.",
    "doi":"10.1109\/MCG.2016.124",
    "outer_cite_count":11.0
  },
  {
    "key":"QJ1V6DWZ",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Marcos Lage;Jorge Piazentin Ono;Daniel Cervone;Justin Chiang;Carlos Dietrich;Claudio T. Silva",
    "affiliations":"New York University;Universidade Federal Fluminense;Collegiate School",
    "title":"StatCast Dashboard: Exploration of Spatiotemporal Baseball Data",
    "keywords":[
      "computer graphics",
      "data-tracking system",
      "event data",
      "information visualization",
      "MLB",
      "sports analytics",
      "StatCast"
    ],
    "abstract":"© 2016 IEEE. Major League Baseball (MLB) has a long history of providing detailed, high-quality data, leading to a tremendous surge in sports analytics research in recent years. In 2015, MLB.com released the StatCast spatiotemporal data-tracking system, which has been used in approximately 2,500 games since its inception to capture player and ball locations as well as semantically meaningful game events. This article presents a visualization and analytics infrastructure to help query and facilitate the analysis of this new tracking data. The goal is to go beyond descriptive statistics of individual plays, allowing analysts to study diverse collections of games and game events. The proposed system enables the exploration of the data using a simple querying interface and a set of flexible interactive visualization tools.",
    "doi":"10.1109\/MCG.2016.101",
    "outer_cite_count":9.0
  },
  {
    "key":"2MXR93NG",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Romain Vuillemot;Charles Perin",
    "affiliations":"Université de Lyon;University of Calgary",
    "title":"Sports Tournament Predictions Using Direct Manipulation",
    "keywords":[
      "computer graphics",
      "direct manipulation",
      "human-computer interaction",
      "information visualization",
      "nonlinear predictions",
      "user interface design",
      "user-generated predictions"
    ],
    "abstract":"© 2016 IEEE. An advanced interface for sports tournament predictions uses direct manipulation to allow users to make nonlinear predictions. Unlike previous interface designs, the interface helps users focus on their prediction tasks by enabling them to first choose a winner and then fill out the rest of the bracket. In real-world tests of the proposed interface (for the 2014 FIFA World Cup tournament and 2015\/2016 UEFA Champions League), the authors validated the use of direct manipulation as an alternative to widgets. Using visitor interaction logs, they were able to determine the strategies people use to perform predictions and identify potential areas of improvement for further prediction interfaces.",
    "doi":"10.1109\/MCG.2016.90",
    "outer_cite_count":5.0
  },
  {
    "key":"E542M668",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Charles Perin;Jeremy Boy;Frederic Vernier",
    "affiliations":"Universite Paris-Saclay;United Nations;University of Calgary",
    "title":"Using Gap Charts to Visualize the Temporal Evolution of Ranks and Scores",
    "keywords":[
      "computer graphics",
      "gap chart",
      "infographics",
      "quantitative evaluation",
      "rank chart",
      "ranking",
      "score chart",
      "soccer",
      "sports",
      "time-series",
      "visualization"
    ],
    "abstract":"© 2016 IEEE. To address the limitations of traditional line chart approaches, in particular rank charts (RCs) and score charts (SCs), a novel class of line charts called gap charts (GCs) show entries that are ranked over time according to a performance metric. The main advantages of GCs are that entries never overlap (only changes in rank generate limited overlap between time steps) and gaps between entries show the magnitude of their score difference. The authors evaluate the effectiveness of GCs for performing different types of tasks and find that they outperform standard time-dependent ranking visualizations for tasks that involve identifying and understanding evolutions in both ranks and scores. They also show that GCs are a generic and scalable class of line charts by applying them to a variety of different datasets.",
    "doi":"10.1109\/MCG.2016.100",
    "outer_cite_count":9.0
  },
  {
    "key":"TRL1RM4P",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"David H.S. Chung;Matthew L. Parry;Iwan W. Griffiths;Robert S. Laramee;Rhodri Bown;Philip A. Legg;Min Chen",
    "affiliations":"Welsh Rugby Union Limited;University of Oxford;University of the West of England;Prifysgol Abertawe;SportsViz;A-STEM Research Centre",
    "title":"Knowledge-Assisted Ranking: A Visual Analytic Application for Sports Event Data",
    "keywords":[
      "computer graphics",
      "regression techniques",
      "sports video data",
      "visual analytic system",
      "visualization"
    ],
    "abstract":"© 2016 IEEE. Organizing sports video data for performance analysis can be challenging, especially in cases involving multiple attributes and when the criteria for sorting frequently changes depending on the user's task. The proposed visual analytic system enables users to specify a sort requirement in a flexible manner without depending on specific knowledge about individual sort keys. The authors use regression techniques to train different analytical models for different types of sorting requirements and use visualization to facilitate knowledge discovery at different stages of the process. They demonstrate the system with a rugby case study to find key instances for analyzing team and player performance. Organizing sports video data for performance analysis can be challenging in cases with multiple attributes, and when sorting frequently changes depending on the user's task. As this video shows, the proposed visual analytic system allows interactive data sorting and exploration.",
    "doi":"10.1109\/MCG.2015.25",
    "outer_cite_count":9.0
  },
  {
    "key":"PX3TL652",
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Rahul C. Basole;Dietmar Saupe",
    "affiliations":"Universität Konstanz;Georgia Institute of Technology",
    "title":"Sports Data Visualization [Guest editors' introduction]",
    "keywords":[
      "computer graphics",
      "sports analytics",
      "sports data visualization",
      "visualization"
    ],
    "abstract":"© 2016 IEEE. For every major sport, analysts can and often do extract large amounts of data, which can be leveraged by media and fans, athletes, and organizations. These efforts are often done in collaboration with leading technology vendors, who also have recognized the tremendous value of sports analytics. The ubiquity, diversity, and relative accessibility of sports data makes it a particularly attractive domain for a range of visualization researchers. Motivated by the significant growth and popularity as well as overall potential of sports data visualization, this special issue gathers state-of-the-art research on this emerging topic.",
    "doi":"10.1109\/MCG.2016.85",
    "outer_cite_count":6.0
  },
  {
    "key":null,
    "publication_name":"IEEE Computer Graphics and Applications",
    "year":2016,
    "author_names":"Manuel Stein;Halldór Janetzko;Thorsten Breitkreutz;Daniel Seebacher;Tobias Schreck;Michael Grossniklaus;Iain D. Couzin;Daniel A. Keim ",
    "affiliations":null,
    "title":"Director’s Cut: Analysis and Annotation of Soccer Matches",
    "keywords":[
      "computer graphics",
      "visual analytics",
      "sport analytics",
      "high-frequency spatiotemporal data"
    ],
    "abstract":"For development and alignment of tactics and strategies, professional soccer analysts spend up to three working days manually analyzing and annotating professional soccer matches. In an effort to improve soccer player and match analysis, a visual-interactive and data-analysis support system focuses on key situations by using rule-based filtering and automatically annotating key types of soccer match elements. The authors evaluate the proposed approach by analyzing real-world soccer matches and several expert studies. Quantitative measures show the proposed methods can significantly outperform naive solutions.",
    "doi":"10.1109\/MCG.2016.102",
    "outer_cite_count":null
  },
  {
    "key":"RE6VK92E",
    "publication_name":"CIVR 2009 - Proceedings of the ACM International Conference on Image and Video Retrieval",
    "year":2009,
    "author_names":"Alexandre Hervieu;Patrick Bouthemy;Jean Pierre Le Cadre",
    "affiliations":"Institut de Recherche en Informatique et Systèmes Aléatoires;INRIA Institut National de Recherche en Informatique et en Automatique",
    "title":"Trajectory-based handball video understanding",
    "keywords":[
      "Computer vision",
      "Motion analysis",
      "Pattern classification",
      "Semi-Markov models",
      "Sports videos"
    ],
    "abstract":"This paper presents a content-based approach for understanding handball videos. Tracked players are characterized by their 2D trajectories in the court plane. The trajectories and their interactions are used to model visual semantics, i.e., the observed activity phases. To this end, hierarchical parallel semi-Markov models (HPaSMMs) are computed in order to take into account the temporal causalities of object motions. Players motions are characterized using velocity informations while their interactions are described by the distances between trajectories. We have evaluated our method on real video sequences, and have favorably compared with another method, i.e., hierarchical parallel hidden Markov models (HPaHMMs). Copyright © 2009 ACM.",
    "doi":"10.1145\/1646396.1646447",
    "outer_cite_count":8.0
  },
  {
    "key":"O5W9YFOY",
    "publication_name":"American Journal of Bioethics",
    "year":2017,
    "author_names":"Katrina Karkazis;Jennifer R. Fishman",
    "affiliations":"Stanford University;McGill University",
    "title":"Tracking U.S. Professional Athletes: The Ethics of Biometric Technologies",
    "keywords":[
      "confidentiality and privacy",
      "conflict of interest",
      "informed consent",
      "professional–patient relationship",
      "risk\/benefit analysis"
    ],
    "abstract":"© 2017, Copyright © Taylor  &  Francis Group, LLC. Professional sport in the United States has widely adopted biometric technologies, dramatically expanding the monitoring of players’ biodata. These technologies have the potential to prevent injuries, improve performance, and extend athletes’ careers; they also risk compromising players’ privacy and autonomy, the confidentiality of their data, and their careers. The use of these technologies in professional sport and the consumer sector remains largely unregulated and unexamined. We seek to provide guidance for their adoption by examining five areas of concern: (1) validity and interpretation of data; (2) increased surveillance and threats to privacy; (3) risks to confidentiality and concerns regarding data security; (4) conflicts of interest; and (5) coercion. Our analysis uses professional sport as a case study; however, these concerns extend to other domains where their use is expanding, including the consumer sector, collegiate and high school sport, the military, and commercial sectors where monitoring employees is viewed as useful for safety or to maximize labor potential.",
    "doi":"10.1080\/15265161.2016.1251633",
    "outer_cite_count":19.0
  },
  {
    "key":"X2L8R6ZZ",
    "publication_name":"International Journal of Performance Analysis in Sport",
    "year":2016,
    "author_names":"Jan Carboch;Katerina Vejvodova;Vladimir Suss",
    "affiliations":"Charles University",
    "title":"Analysis of errors made by line umpires on ATP tournaments",
    "keywords":[
      "Decision-making",
      "Hawk-Eye",
      "Referee",
      "Tennis",
      "Visual perception"
    ],
    "abstract":"© 2018, Routledge. All rights reserved. This is the first study in this field investigating the number and extent of line umpires’ errors during two international, Association of Tennis Professionals (ATP) “Masters 1000” tournaments. Hawk-Eye technology was used on these courts, allowing players to challenge line umpires’ calls. The goal of the study was to determine line umpire error rates for calls reviewed by the Hawk-Eye system. We subsequently determined the mean size of errors and analyzed these errors on specific court lines. Data were obtained from official records of the Hawk-Eye system in selected matches and were provided by ATP. Results showed that line umpires made errors in 27% of cases where Hawk-Eye review technology was utilized. This means that an umpire error occurred once per 17.4 games. The mean size of line umpires’ errors reached 33.2 mm. Most errors occurred at the baseline. A difference in the number and size of errors between cross (transverse) and long lines was found, which suggests that the results for long and cross lines should be treated separately in the evaluation of line umpires’ performance. The line umpires made fewer and smaller mistakes towards the end of a tournament in comparison to its beginning. It is misleading to evaluate line umpires’ performance in %. We suggest that the coefficient 1 error per N games should be used instead.",
    "doi":"10.1080\/24748668.2016.11868885",
    "outer_cite_count":5.0
  },
  {
    "key":"08MHSLQT",
    "publication_name":"Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "year":2007,
    "author_names":"Mitchell Page;Andrew Vande Moere",
    "affiliations":"The University of Sydney",
    "title":"Evaluating a wearable display jersey for augmenting team sports awareness",
    "keywords":[
      "Design",
      "Evaluation",
      "Visualization",
      "Wearable computing"
    ],
    "abstract":"This paper introduces a user-centered design process and case study evaluation of a novel wearable visualization system for team sports, coined TeamAwear. TeamAwear consists of three basketball jerseys that are equipped with electroluminescent wires and surfaces. Each jersey can be wirelessly controlled to represent game-related information on the player in real-time, such as the amount of individual fouls, scores and time alerts. A participatory usercentered approach guided the development process towards a more meaningful, ethically and economically valid design. The system aims to enhance the awareness and understanding of game-related public information for all stakeholders, including players, referees, coaches and audience members. We initially hypothesized that such increased awareness would positively influence in-game decisions by players, resulting in a more interesting and enjoyable game play experience for all participants. Instead, the case study evaluation demonstrated TeamAwear's perceived usefulness particularly for non-playing stakeholders, such as the audience, referees and coaches, supporting more accurate coaching assessments, better understanding of in-game situations and increased enjoyment for spectators. The high amount of game-related cognitive load on the players during game-play seems to hinder its influence on in-game decisions. © Springer-Verlag Berlin Heidelberg 2007.",
    "doi":"10.1007\/978-3-540-72037-9_6",
    "outer_cite_count":13.0
  },
  {
    "key":"8F7NOON0",
    "publication_name":"UbiComp'11 - Proceedings of the 2011 ACM Conference on Ubiquitous Computing",
    "year":2011,
    "author_names":"Ian Li;Anind K. Dey;Jodi Forlizzi",
    "affiliations":"Carnegie Mellon University",
    "title":"Understanding my data, myself: Supporting self-reflection with ubicomp technologies",
    "keywords":[
      "design features",
      "discovery",
      "personal informatics",
      "phases",
      "reflection",
      "visualizations"
    ],
    "abstract":"We live in a world where many kinds of data about us can be collected and more will be collected as Ubicomp technologies mature. People reflect on this data using different tools for personal informatics. However, current tools do not have sufficient understanding of users' self-reflection needs to appropriately leverage Ubicomp technologies. To design tools that effectively assist self-reflection, we need to comprehensively understand what kinds of questions people have about their data, why they ask these questions, how they answer them with current tools, and what kinds of problems they encounter. To explore this, we conducted interviews with people who use various kinds of tools for personal informatics. We found six kinds of questions that people asked about their data. We also found that certain kinds of questions are more important at certain times, which we call phases. We identified two phases of reflection: Discovery and Maintenance. We discuss the kinds of questions and the phases in detail and identify features that should be supported in personal informatics tools for which Ubicomp technologies can play an important role. © 2011 ACM.",
    "doi":"10.1145\/2030112.2030166",
    "outer_cite_count":239.0
  },
  {
    "key":"GZQHGWSM",
    "publication_name":"IEEE Transactions on Knowledge and Data Engineering",
    "year":2016,
    "author_names":"Xinyu Wei;Patrick Lucey;Stuart Morgan;Sridha Sridharan",
    "affiliations":"The Walt Disney Company;Queensland University of Technology QUT;Australian Institute of Sports",
    "title":"Forecasting the Next Shot Location in Tennis Using Fine-Grained Spatiotemporal Tracking Data",
    "keywords":[
      "Event forecasting",
      "Hawk-eye data",
      "player behaviour analysis",
      "shot prediction",
      "tennis"
    ],
    "abstract":"© 2016 IEEE. In professional sport, an enormous amount of fine-grain performance data can be generated at near millisecond intervals in the form of vision-based tracking data. One of the first sports to embrace this technology has been tennis, where Hawk-Eye technology has been used to both aid umpiring decisions, and to visualize shot trajectories for broadcast purposes. Despite the high-level of accuracy of the tracking systems and the sheer volume of spatiotemporal data they generate, the use of this data for player performance analysis and prediction has been lacking. In this research, we use ball and player tracking data from \"Hawk-Eye\" to discover unique player styles and predict within-point events. We move beyond current analysis that only incorporates coarse match statistics (i.e., serves, winners, number of shots, and volleys) and use spatial and temporal information which better characterizes the tactics and tendencies of each player. Using a probabilistic graphical model, we are able to model player behaviors which enables us to: 1) find the factors such as location and speed of the incoming shot which are most conducive to a player hitting a winner (i.e., \"sweet-spot\") or cause an error, and 2) do \"live in-point\" prediction - based on the shots being played during a rally we estimate the probability of the outcome (e.g., winner, continuation, or error) and the location of the next shot. As player behavior depends on the opponent, we use model adaptation to enhance our prediction. We show the utility of our approach by analyzing the play of Djokovic, Nadal, and Federer at the 2012 Australian Tennis Open.",
    "doi":"10.1109\/TKDE.2016.2594787",
    "outer_cite_count":9.0
  },
  {
    "key":"NJ076DGK",
    "publication_name":"Online Information Review",
    "year":2016,
    "author_names":"Orland Hoeber;Larena Hoeber;Maha El Meseery;Kenneth Odoh;Radhika Gopi",
    "affiliations":"University of Regina",
    "title":"Visual Twitter Analytics (Vista): Temporally changing sentiment and the discovery of emergent themes within sport event tweets",
    "keywords":[
      "Exploratory data analysis",
      "Sport analytics",
      "Twitter",
      "Visual analytics"
    ],
    "abstract":"© Emerald Group Publishing Limited. Purpose-Due to the size and velocity at which user generated content is created on social media services such as Twitter, analysts are often limited by the need to pre-determine the specific topics and themes they wish to follow. Visual analytics software may be used to support the interactive discovery of emergent themes. The paper aims to discuss these issues. Design\/methodology\/approach-Tweets collected from the live Twitter stream matching a users query are stored in a database, and classified based on their sentiment. The temporally changing sentiment is visualized, along with sparklines showing the distribution of the top terms, hashtags, user mentions, and authors in each of the positive, neutral, and negative classes. Interactive tools are provided to support sub-querying and the examination of emergent themes. Findings-A case study of using Vista to analyze sport fan engagement within a mega-sport event (2013 Le Tour de France) is provided. The authors illustrate how emergent themes can be identified and isolated from the large collection of data, without the need to identify these a priori. Originality\/value-Vista provides mechanisms that support the interactive exploration among Twitter data. By combining automatic data processing and machine learning methods with interactive visualization software, researchers are relieved of tedious data processing tasks, and can focus on the analysis of high-level features of the data. In particular, patterns of Twitter use can be identified, emergent themes can be isolated, and purposeful samples of the data can be selected by the researcher for further analysis.",
    "doi":"10.1108\/OIR-02-2015-0067",
    "outer_cite_count":26.0
  },
  {
    "key":"YBFE7WLN",
    "publication_name":"ACM International Conference Proceeding Series",
    "year":2009,
    "author_names":"Greg Smith;Desney Tan;Bongshin Lee",
    "affiliations":"Microsoft Research",
    "title":"iSee: Interactive scenario explorer for online tournament games",
    "keywords":[
      "Fantasy games",
      "Office pools",
      "Scenario exploration",
      "Tournament"
    ],
    "abstract":"Fantasy games, in which players compete to correctly predict real-world outcomes in sports, entertainment, and politics, have grown in popularity and now represent a significant portion of online gaming. Pick'em pools, also known as office pools, are a fantasy game specifically focused on tournament-style competitions such as the \"March Madness\" NCAA basketball championship. Pick'em pool players often spend significant time trying to understand the current state of competition and to anticipate future events that may significantly affect their performance within the pool. Unfortunately, the combinatorial nature of the outcome space makes these tasks extremely challenging, and intuition is often a highly inaccurate guide. In this paper we present iSee, a system that allows players to make these complex calculations and inferences. We describe a variety of interface options for the interactive presentation of tournament outcome visualizations. We also describe in detail the implementation of a set of algorithms for reliably projecting player performance and distilling the complex outcome space to a number of key scenarios. Finally, we report on a pilot study soliciting user feedback on the system. © ACM 2009.",
    "doi":"10.1145\/1690388.1690420",
    "outer_cite_count":1.0
  },
  {
    "key":"4W8R4T1Y",
    "publication_name":"Proceedings of the Workshop on Advanced Visual Interfaces AVI",
    "year":2016,
    "author_names":"Fadi Botros;Charles Perin;Bon Adriel Aseniero;Sheelagh Carpendale",
    "affiliations":"University of Calgary",
    "title":"Go and grow: Mapping personal data to a living plant",
    "keywords":[
      "Fitness",
      "Living visualization",
      "Personal visualization",
      "Plant"
    ],
    "abstract":"© 2016 Copyright held by the owner\/author(s). Motivation is a key factor for introducing and maintaining healthy changes in behaviour. However, typical visualization methods (e.g., bar-, pie-, and line charts) hardly motivate individuals. We investigate how a plant-a living visualization-whose health relies on the plant owner's level of activity, can engage people in tracking and self-reflecting on their fitness data. To address this question, we designed, implemented, and studied Go & Grow, a living plant that receives water proportionally to its owner's activity. Our six-week qualitative study with ten participants suggests that living visualizations have qualities that their digital counterparts do not have. This includes people feeling: Emotionally connected to their plant; sentiments such as pride and guilt; and responsibility towards their plant. Based on this study, we introduce the Goal Motivation Model, a model considering the diversity of individuals, thus supporting and encouraging a diversity of strategies for accomplishing goals.",
    "doi":"10.1145\/2909132.2909267",
    "outer_cite_count":7.0
  },
  {
    "key":"PLWNI7BD",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Krist Wongsuphasawat",
    "affiliations":null,
    "title":"A Narrative Display for Sports Tournament Recap",
    "keywords":[
      "football",
      "soccer",
      "timeline",
      "time-series",
      "Tweets",
      "Twitter",
      "sports",
      "visualization"
    ],
    "abstract":"During major sports competitions, such as the FIFA World Cup, billions of people around the world turn their attentions to the results and stories of the tournament. There have been many visualization created to tell the stories of these competitions. Some focus on showing individual matches. Some focus on showing tournament overview. However, it is difficult to find a visualization that show both tournament overview and match details. In this paper, I describe a simple approach to collect data from Twitter to highlight interesting moments from football (soccer) matches, and propose a visualization that summarizes a tournament in a way that provides both an overview of the tournament and match details.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"1QEC4U8H",
    "publication_name":"Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
    "year":2014,
    "author_names":"Michael Burch;Daniel Weiskopf",
    "affiliations":"Universität Stuttgart",
    "title":"Tennis plots: Game, set, and match",
    "keywords":[
      "hierarchical data",
      "sports data",
      "time-varying data"
    ],
    "abstract":"In this paper we introduce Tennis Plots as a novel diagram type to better understand the differently long time periods in tennis matches on different match structure granularities. We visually encode the dynamic tennis match by using a hierarchical concept similar to layered icicle representations used for visualizing information hierarchies. The time axis is represented vertically as multiple aligned scales to indicate the durations of games and points and to support comparison tasks. Color coding is used to indicate additional attributes attached to the data. The usefulness of Tennis Plots is illustrated in a case study investigating the tennis match of the women's Wimbledon final 1988 between Steffi Graf and Martina Navratilova lasting 1 hour, 19 minutes, and 31 seconds and being played over three sets (5:7, 6:2, 6:1). Interaction techniques are described in the case study in order to explore the data for insights. © 2014 Springer-Verlag.",
    "doi":"10.1007\/978-3-662-44043-8_5",
    "outer_cite_count":2.0
  },
  {
    "key":"992PGSBO",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":1994,
    "author_names":"David Turo",
    "affiliations":"University of Maryland",
    "title":"Hierarchical visualization with treemaps: Making sense of pro basketball data",
    "keywords":[
      "Hierarchy",
      "Statistics",
      "Treemap",
      "Visualization"
    ],
    "abstract":"© 1994 ACM. Maps support visualization of large hierarchical information spaces. The treemap generation algorithm is straightforward and application prototypes have only minimal hardware requirements. Given primary graphical encodings of area, color and enclosure, treemaps are best suited for the tasks of outlier detection, cause-effect analysis and location of specific nodes-satisfying user-specified criteria-in their hierarchical context. Distortion effects extend treemap capabilities by emphasizing node relationships in the diagram.",
    "doi":"10.1145\/259963.260441",
    "outer_cite_count":9.0
  },
  {
    "key":"TI28T9GD",
    "publication_name":"Data",
    "year":2017,
    "author_names":"Manuel Stein;Halldór Janetzko;Daniel Seebacher;Alexander Jäger;Manuel Nagel;Jürgen Hölsch;Sven Kosub;Tobias Schreck;Daniel A. Keim;Michael Grossniklaus",
    "affiliations":"Københavns Universitet;Universität Konstanz;Technische Universitat Graz;University of Zurich",
    "title":"How to make sense of team sport data: From acquisition to data modeling and research aspects",
    "keywords":[
      "High frequency spatio-temporal data",
      "Sport analytics",
      "Visual analytics"
    ],
    "abstract":"© 2017 by the authors; licensee MDPI, Basel, Switzerland. Automatic and interactive data analysis is instrumental in making use of increasing amounts of complex data. Owing to novel sensor modalities, analysis of data generated in professional team sport leagues such as soccer, baseball, and basketball has recently become of concern, with potentially high commercial and research interest. The analysis of team ball games can serve many goals, e.g., in coaching to understand effects of strategies and tactics, or to derive insights improving performance. Also, it is often decisive to trainers and analysts to understand why a certain movement of a player or groups of players happened, and what the respective influencing factors are. We consider team sport as group movement including collaboration and competition of individuals following specific rule sets. Analyzing team sports is a challenging problem as it involves joint understanding of heterogeneous data perspectives, including high-dimensional, video, and movement data, as well as considering team behavior and rules (constraints) given in the particular team sport. We identify important components of team sport data, exemplified by the soccer case, and explain how to analyze team sport data in general. We identify challenges arising when facing these data sets and we propose a multi-facet view and analysis including pattern detection, context-aware analysis, and visual explanation. We also present applicable methods and technologies covering the heterogeneous aspects in team sport data.",
    "doi":"10.3390\/data2010002",
    "outer_cite_count":24.0
  },
  {
    "key":"ZEAAXRYE",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2014,
    "author_names":"Vidya Setlur;Jock D. Mackinlay",
    "affiliations":"Tableau Software;Tableau Software",
    "title":"Automatic generation of semantic icon encodings for visualizations",
    "keywords":[
      "Icon encodings",
      "Image retrieval",
      "Natural language processing",
      "Visualization"
    ],
    "abstract":"Authors use icon encodings to indicate the semantics of categorical information in visualizations. The default icon libraries found in visualization tools often do not match the semantics of the data. Users often manually search for or create icons that are more semantically meaningful. This process can hinder the flow of visual analysis, especially when the amount of data is large, leading to a suboptimal user experience. We propose a technique for automatically generating semantically relevant icon encodings for categorical dimensions of data points. The algorithm employs natural language processing in order to find relevant imagery from the Internet. We evaluate our approach on Mechanical Turk by generating large libraries of icons using Tableau Public workbooks that represent real analytical effort by people out in the world. Our results show that the automatic algorithm does nearly as well as the manually created icons, and particularly has higher user satisfaction for larger cardinalities of data.",
    "doi":"10.1145\/2556288.2557408",
    "outer_cite_count":13.0
  },
  {
    "key":"PARWO7FF",
    "publication_name":"Proceedings of the 7th IASTED International Conference on Visualization, Imaging, and Image Processing, VIIP 2007",
    "year":2007,
    "author_names":"A. Telea;P. De Hillerin;V. Valeanu",
    "affiliations":"Technische Universiteit Eindhoven;Institute for Educational Sciences;National Institute for Research",
    "title":"Visualization of multivariate athlete performance data",
    "keywords":[
      "Information visualization",
      "Multivariate visualization",
      "Visual analytics"
    ],
    "abstract":"We present a set of visualization methods for the analysis of multivariate data recorded from the measurement of the performance of athletes during training. We use a modi-fied training device to measure the force, acceleration, displacement, and speed of the athlete's feet and arms while performing a certain training exercise. We are interested in visually measuring and comparing the performance over several training sessions of the same and\/or different athletes. For this, we adapt and extend several visualization methods for multivariate data. First, we use an enhanced signal plot and statistics plot to visualize the regularity of repetitions within a given exercise. Second, we use a novel texture-based signal plot to eliminate signal noise and emphasize the average repetitive pattern of the exercise. Finally, we use a signal clustering technique, visualized with a matrix plot, to detect similar exercises over long periods of time. We demonstrate our approaches with actual data from training sessions of several athletes.",
    "doi":null,
    "outer_cite_count":4.0
  },
  {
    "key":"EXYHYLWQ",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2009,
    "author_names":"Anthony Tang;Saul Greenberg;Sidney Fels",
    "affiliations":"The University of British Columbia;University of Calgary",
    "title":"Exploring video streams using slit-tear visualizations",
    "keywords":[
      "Information visualization",
      "Video analysis",
      "Video interaction",
      "Video visualization"
    ],
    "abstract":"Slit-tear visualizations allow users to selectively visualize pixel paths in a video scene. The slit-tear visualization technique is a generalization of the traditional photographic slit-scanning and more recent video slicing techniques: after a user specifies a pixel path of interest, the system generates a timeline that replicates those pixels for each frame in the video. These rich visualizations of the video data help users to discover and explore spatio-temporal patterns of activity in a video. In this video, we illustrate the use of slit-tear visualizations to detect movement and incidence of activity in a video scene, accentuate directional motion and small changes in the video, and discover patterns of activity between spatially distinct areas of the scene.",
    "doi":"10.1145\/1520340.1520516",
    "outer_cite_count":5.0
  },
  {
    "key":"PMX0YL8R",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Ricardo Cava;Carla Dal Sasso Freitas",
    "affiliations":null,
    "title":"Glyphs in Matrix Representation of Graphs for Displaying Soccer Games Results",
    "keywords":[
      "Information visualization", 
      "sports visualization", 
      "glyphs", 
      "soccer"
    ],
    "abstract":"Soccer is a popular game in many countries. Aiming at showing information about soccer teams performance along competitions several sites publish match statistics. Although those sites gather a lot of informtion, they in general present them in a table format, with little usage of graphics, making analysis harder for users. This work has a twofold goal: to propose an alternative for the visualization of varied attributes associated to the edges of a graph that represents a soccer competition and, also in such alternative, to provide an overview of the teams’ results in all matches. The paper presents the proposed visualization technique with details regarding glyphs design and usage. Examples with data from a large competition is used to show preliminary results.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"R10G2PKS",
    "publication_name":"IEEE Transactions on Visualization and Computer Graphics",
    "year":2015,
    "author_names":"Dandan Huang;Melanie Tory;Bon Adriel Aseniero;Lyn Bartram;Scott Bateman;Sheelagh Carpendale;Anthony Tang;Robert Woodbury",
    "affiliations":"Simon Fraser University;University of Prince Edward Island;University of Victoria;University of Calgary",
    "title":"Personal visualization and personal visual analytics",
    "keywords":[
      "interaction design",
      "Mobile and ubiquitous visualization",
      "personal context",
      "Taxonomy"
    ],
    "abstract":"© 1995-2012 IEEE. Data surrounds each and every one of us in our daily lives, ranging from exercise logs, to archives of our interactions with others on social media, to online resources pertaining to our hobbies. There is enormous potential for us to use these data to understand ourselves better and make positive changes in our lives. Visualization (Vis) and visual analytics (VA) offer substantial opportunities to help individuals gain insights about themselves, their communities and their interests; however, designing tools to support data analysis in non-professional life brings a unique set of research and design challenges. We investigate the requirements and research directions required to take full advantage of Vis and VA in a personal context. We develop a taxonomy of design dimensions to provide a coherent vocabulary for discussing personal visualization and personal visual analytics. By identifying and exploring clusters in the design space, we discuss challenges and share perspectives on future research. This work brings together research that was previously scattered across disciplines. Our goal is to call research attention to this space and engage researchers to explore the enabling techniques and technology that will support people to better understand data relevant to their personal lives, interests, and needs.",
    "doi":"10.1109\/TVCG.2014.2359887",
    "outer_cite_count":107.0
  },
  {
    "key":"MO3ZZLRY",
    "publication_name":"Journal of Sports Sciences",
    "year":2002,
    "author_names":"Andrew Borrie;Gudberg K. Jonsson;Magnus S. Magnusson",
    "affiliations":"Liverpool John Moores University",
    "title":"Temporal pattern analysis and its applicability in sport: An explanation and exemplar data",
    "keywords":[
      "Match analysis",
      "Pattern",
      "Performance",
      "Temporal"
    ],
    "abstract":"Quantitative analysis of sports performance has been shown to produce information that coaches can use within the coaching process to enhance performance. Traditional methods for quantifying sport performances are limited in their capacity to describe the complex interactions of events that occur within a performance over time. In this paper, we outline a new approach to the analysis of time-based event records and real-time behaviour records on sport performance known as T-pattern detection. The relevant elements of the T-pattern detection process are explained and exemplar data from the analysis of 13 soccer matches are presented to highlight the potential of this form of analysis. The results from soccer suggest that it is possible to identify new profiles for both individuals and teams based on the analysis of temporal behavioural patterns detected within the performances.",
    "doi":"10.1080\/026404102320675675",
    "outer_cite_count":135.0
  },
  {
    "key":"HMT9PZD5",
    "publication_name":"Lecture Notes in Engineering and Computer Science",
    "year":2015,
    "author_names":"Toshihiro Tani;Hung Hsuan Huang;Kyoji Kawagoe",
    "affiliations":"Ritsumeikan University",
    "title":"Sports play visualization system for American Football",
    "keywords":[
      "Mining",
      "Strategy analysis",
      "Visualization"
    ],
    "abstract":"In this paper, a sports strategy decision support system, called SportsViz, for ball games is presented. Both the results of statistical analysis and player motions are visualized in an integrated way to facilitate easy decision making by this system. The player motions can be easily aggregated with our newly developed trajectory mining technique for deep consideration on the motions. It is also described here that our system can be effective in football strategy analysis.",
    "doi":null,
    "outer_cite_count":5.0
  },
  {
    "key":"RARNWQDM",
    "publication_name":"GIS: Proceedings of the ACM International Symposium on Advances in Geographic Information Systems",
    "year":2011,
    "author_names":"Ho Chul Kim;Oje Kwon;Ki Joune Li",
    "affiliations":"Pusan National University",
    "title":"Spatial and spatiotemporal analysis of soccer",
    "keywords":[
      "modeling",
      "morphology",
      "soccer analysis",
      "spatial and spatiotemporal features",
      "trajectory"
    ],
    "abstract":"Soccer matches consist of spatial and spatiotemporal objects including a ball, players, and a field. Players and ball are also moving objects. This means that spatial and spatiotemporal analysis on ball and players could be useful in studying soccer tactics. From this view point, we extend the application areas of spatial information science to soccer tactic analysis. First we define a feature model to specify the basic units of analysis. Second, we study the morphological properties of each feature type. Third, a set of operations are defined for each feature type. Fourth, we perform an experiment with a real data set of the 2006 World Cup final match to validate the usefulness of our framework. Even though we focus on soccer match, we expect that this framework can be applied to similar sports such as handball and basket ball. © 2011 Authors.",
    "doi":"10.1145\/2093973.2094029",
    "outer_cite_count":17.0
  },
  {
    "key":"QM6K2HPW",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Michael Stoll;Robert Krüger;Thomas Ertl;Andrés Bruhn",
    "affiliations":null,
    "title":"Racecar Tracking and its Visualization Using Sparse Data",
    "keywords":[
      "Motorsports",
      "tracking",
      "uncertainty",
      "visualization"
    ],
    "abstract":"In motorsports there are typically long race tracks with the result that the racecars’ positions can not be surveyed easily. Professional motorsports series – such as the famous Formula 1 – introduced car tracking visualizations where the position of each participant is displayed on a virtual map. In contrast to professional motorsports series, in amateur motorsports dense data, which is crucial for accurate tracking, is often not acquired. In our paper, we present ideas that allow car tracking that is informative and visually pleasing using sparser data. To this end, we propose different strategies for data integration as well as for interpolation and approximation, respectively, and introduce a visualization that displays the inevitable uncertainty of each racecar’s position.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":null,
    "publication_name":"UbiComp 2006: Ubiquitous Computing",
    "year":2006,
    "author_names":"James J. Lin;Lena Mamykin;Silvia Lindtner;Gregory Delajoux;Henry B. Strub",
    "affiliations":null,
    "title":"Physical Activity Step Count Transtheoretical Model Daily Step Virtual Character ",
    "keywords":[
      "Physical Activity",
      "Step Count",
      "Transtheoretical Model",
      "Daily Step",
      "Virtual Character "
    ],
    "abstract":"A sedentary lifestyle is a contributing factor to chronic diseases, and it is often correlated with obesity. To promote an increase in physical activity, we created a social computer game, Fish’n’Steps, which links a player’s daily foot step count to the growth and activity of an animated virtual character, a fish in a fish tank. As further encouragement, some of the players’ fish tanks included other players’ fish, thereby creating an environment of both cooperation and competition. In a fourteen-week study with nineteen participants, the game served as a catalyst for promoting exercise and for improving game players’ attitudes towards physical activity. Furthermore, although most player’s enthusiasm in the game decreased after the game’s first two weeks, analyzing the results using Prochaska’s Transtheoretical Model of Behavioral Change suggests that individuals had, by that time, established new routines that led to healthier patterns of physical activity in their daily lives. Lessons learned from this study underscore the value of such games to encourage rather than provide negative reinforcement, especially when individuals are not meeting their own expectations, to foster long-term behavioral change.",
    "doi":"10.1007\/11853565_16",
    "outer_cite_count":null
  },
  {
    "key":"237KJ44T",
    "publication_name":"Conference on Human Factors in Computing Systems - Proceedings",
    "year":2014,
    "author_names":"Charles Perin;Romain Vuillemot;Jean Daniel Fekete",
    "affiliations":"INRIA Institut National de Recherche en Informatique et en Automatique;Harvard University",
    "title":"À table! Improving temporal navigation in soccer ranking tables",
    "keywords":[
      "Ranking Tables",
      "Soccer",
      "Temporal Navigation",
      "Visualization"
    ],
    "abstract":"This article introduces À Table!, an enhanced soccer ranking table providing temporal navigation by combining two novel interaction techniques. Ranking tables order soccer teams represented as rows, according to values of columns containing attributes e. g., accumulated points, or number of scored goals. Because they represent a snapshot of a championship at a time t, tables are regularly updated with new results. Such updates usually change the rows order, which makes the tracking of a specified team over time difficult. We observed that the tables available on the web do not support tracking such changes very well, are generally hard to read, and lack interactions. This contrasts with the extensive use of comments on temporal trends found in soccer analysts articles. To better support such analyzes, the two interactive techniques presented allow exploration of time, and are designed to preserve users' flow: DRAG-CELL is based on direct manipulation of values to browse ranks; VIZ-RANK uses a transient line chart of team ranks to visually explore a championship. An on-line evaluation with 143 participants shows that each technique efficiently supports a set of important temporal tasks not supported by current ranking tables. This paves the way for introducing efficient advanced visual exploration techniques to millions of soccer enthusiasts who use tables everyday.",
    "doi":"10.1145\/2556288.2557379",
    "outer_cite_count":21.0
  },
  {
    "key":"K5B1Y2AH",
    "publication_name":"ISPRS International Journal of Geo-Information",
    "year":2015,
    "author_names":"Manuel Stein;Johannes Häußler;Dominik Jäckle;Halldór Janetzko;Tobias Schreck;Daniel A. Keim",
    "affiliations":"Universität Konstanz;Technische Universitat Graz",
    "title":"Visual soccer analytics: Understanding the characteristics of collective team movement based on feature-driven analysis and abstraction",
    "keywords":[
      "Soccer analysis",
      "Sport analytics",
      "Visual analytics"
    ],
    "abstract":"© 2015 by the authors; licensee MDPI, Basel, Switzerland. With recent advances in sensor technologies, large amounts of movement data have become available in many application areas. A novel, promising application is the data-driven analysis of team sport. Specifically, soccer matches comprise rich, multivariate movement data at high temporal and geospatial resolution. Capturing and analyzing complex movement patterns and interdependencies between the players with respect to various characteristics is challenging. So far, soccer experts manually post-analyze game situations and depict certain patterns with respect to their experience. We propose a visual analysis system for interactive identification of soccer patterns and situations being of interest to the analyst. Our approach builds on a preliminary system, which is enhanced by semantic features defined together with a soccer domain expert. The system includes a range of useful visualizations to show the ranking of features over time and plots the change of game play situations, both helping the analyst to interpret complex game situations. A novel workflow includes improving the analysis process by a learning stage, taking into account user feedback. We evaluate our approach by analyzing real-world soccer matches, illustrate several use cases and collect additional expert feedback. The resulting findings are discussed with subject matter experts.",
    "doi":"10.3390\/ijgi4042159",
    "outer_cite_count":15.0
  },
  {
    "key":"MM40P11Y",
    "publication_name":"Communications in Computer and Information Science",
    "year":2016,
    "author_names":"Miohk Yoo;Kyoungju Park",
    "affiliations":"Chung-Ang University",
    "title":"Visual analysis of soccer match using player motion data",
    "keywords":[
      "Soccer match data",
      "Visual analytics system",
      "Visualization"
    ],
    "abstract":"© Springer International Publishing Switzerland 2016. Sports data analysis has come to play a significant role in improving player performances as these analytics proved to aid in reversing the fortunes of ailing sports teams. With tremendous advancement of digital devices such as cameras, sensors, and wearables, analytic providers are now able to record many aspects of player performance. However, soccer data obtained through these devices are of a complex structure and not provided in a standardized format. Thus finding effective ways to manage and comprehend massive player feature data has become an inevitable problem to solve. Therefore, we suggest a method of analysis system to allow the users to easily analyze and comprehend the context of soccer game by visually portrayed player aspect data based specifically on player movements throughout the game.",
    "doi":"10.1007\/978-3-319-40548-3_52",
    "outer_cite_count":0.0
  },
  {
    "key":"0MH5NDI6",
    "publication_name":"IEEE International Conference on Data Mining Workshops, ICDMW",
    "year":2015,
    "author_names":"Alina Bialkowski;Patrick Lucey;Peter Carr;Yisong Yue;Sridha Sridharan;Iain Matthews",
    "affiliations":"The Walt Disney Company;California Institute of Technology;Queensland University of Technology QUT",
    "title":"Identifying team style in soccer using formations learned from spatiotemporal tracking data",
    "keywords":[
      "Spatiotemporal Data",
      "Sports Analytics",
      "Style",
      "Team Identity"
    ],
    "abstract":"© 2014 IEEE. To the trained-eye, experts can often identify a team based on their unique style of play due to their movement, passing and interactions. In this paper, we present a method which can accurately determine the identity of a team from spatiotemporal player tracking data. We do this by utilizing a formation descriptor which is found by minimizing the entropy of role-specific occupancy maps. We show how our approach is significantly better at identifying different teams compared to standard measures (i.e., Shots, passes etc.). We demonstrate the utility of our approach using an entire season of Prozone player tracking data from a top-tier professional soccer league.",
    "doi":"10.1109\/ICDMW.2014.167",
    "outer_cite_count":24.0
  },
  {
    "key":"B40RQIH6",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Charles Perin;Frédéric Vernier",
    "affiliations":null,
    "title":"R2S2: a Hybrid Technique to Visualize Sport Ranking Evolution",
    "keywords":[
      "Sport",
      "Ranking",
      "Rank Chart",
      "Slope Graph",
      "Time Series",
      "Hybrid Visualization"
    ],
    "abstract":"This article presents R2S2, a hybrid visualization technique as an intermediate step between Rank Chart and Slope Graph to better understand and analyze team evolutions during soccer championships. Currently used rank tables for soccer are relative (ranked-based) and do not convey the absolute difference between teams. R2S2 provides a way to visualize these differences using the Slope Graph technique (value-based). By interactively setting the parameters of R2S2, we make the distance between teams appear, minimizing the overlaps caused by the Slope Graph technique.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"DWNJNH1N",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Bo Moon;Richard Brath",
    "affiliations":null,
    "title":"Bloomberg Sports Visualization for Pitch Analysis",
    "keywords":[
      "Sports visualization, baseball pitch analysis, video analysis, big data visualization"
    ],
    "abstract":"Visualization of big data in baseball at the per pitch level including measured data and video can be made effective for coaches and managers through a variety of information visualization techniques focused on creating easy to use and easy to understand visualizations. Visualization techniques include filtering, linked familiar views, multi variate glyphs with inituituve mappings to color and shape, aggregation via heatgrids and contour maps, and a workflow to support video analysis to and from the visualization.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"LOR98YLC",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Charles Perin;Romain Vuillemot;Jean-Daniel Fekete",
    "affiliations":null,
    "title":"Real-Time Crowdsourcing of Detailed Soccer Data",
    "keywords":[
      "Sports",
      "Crowdsourcing"
    ],
    "abstract":"This article explores how spectators of a live soccer game can collect detailed data while watching the game. Our motivation arouse from the lack of free detailed sport data, contrasting with the large amount of simple statistics collected for every popular games and available on the web. Assuming many spectators carry a smart phone during a game, we implemented a series of input interfaces for collecting data in real time. In a user study, we asked participants to use those interfaces to perform tracking tasks such as locating players in the field, qualifying ball passes, and naming the player with ball while watching a video clip of a real soccer game. Our two main results are 1) the crowd can collect detailed–and fairly complex–data in real-time with reasonable quality while each participant is assigned a simple task, and 2) a set of design implications for crowd-powered interfaces to collect live sport data. We also discuss the use of such data into a system we developed to visualize soccer phases, and the design implications coming with the visual communication of missing and uncertain detailed data.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"WC2ORNEG",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Fabian Beck;Michael Burch;Daniel Weiskopf",
    "affiliations":null,
    "title":"Visual Comparison of Time-Varying Athletes’ Performance",
    "keywords":[
      "Time series visualization",
      "visual comparison",
      "sports visualization",
      "matrix visualization"
    ],
    "abstract":"In the field of sports, large amounts of data are measured and stored with the help of modern electronic devices. In particular, for endurance sports events, time-varying data are recorded and can be used to analyze the athletes’ performance. Finding patterns and issues can help to better understand results in sports competitions, which is of interest for the athletes themselves, sports managers, and trainers, but also for mass media and spectators. In this paper, we introduce a matrix-based concept to visually compare similar and dissimilar periods in performances of two athletes. We differentiate the performances and visually encode these differences as color-coded matrix cells. The strengths of our approach are illustrated in a case study investigating the performances of two riders in the prologue of Tour de France 2012.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"0AZAXZF5",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Orland Hoeber;Larena Hoeber;Laura Wood;Ryan Snelgrove;Isabella Hugel;Dayne Wagner",
    "affiliations":null,
    "title":"Visual Twitter Analytics: Exploring Fan and Organizer Sentiment During Le Tour de France",
    "keywords":[
      "Twitter",
      "sentiment analysis",
      "visual analytics",
      "sport management",
      "sport communication",
      "fan experience"
    ],
    "abstract":"In recent years, Twitter has become a valuable source of information regarding the public perception of products, services, and events. Not only have many sport organizations embraced Twitter as a communication mechanism, the public and collaborative nature of Twitter has allowed fans to communicate with and respond to the organizers, as well as with one another. As a result, Twitter represents a vast wealth of information for understanding fan and sport organization behaviour. However, analyzing such data for the purposes of sport management research is difficult due to the size, temporality, and textual nature of the data. In this paper, we present a visual analytics approach to analyzing the temporally changing sentiment within Twitter, called Vista. Machine learning is used to extract sentiment from individual tweets, which are visually represented using a timeline; interactive tools support exploration and analytical reasoning about the data. A case study is provided to illustrate the types of analyses that can be performed with Vista.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"APN4YW8T",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Sean Gabriel Owens;T.J. Jankun-Kelly",
    "affiliations":null,
    "title":"Visualizations for Exploration of American Football Season and Play Data",
    "keywords":[
      "Visualization",
      "american collegiate football",
      "sports visualization",
      "arc diagram",
      "spatial mapping"
    ],
    "abstract":"Sports visualization is an emerging area of research. As the sports' industries are quickly rising into the billions of dollars in value, the need for performance evaluation is great. While, many sports such as baseball and soccer have developed fairly extensive visualization platforms for viewing player and team performance, one sport that has been lacking in meaningful visualizations is American football. The sport poses a challenge because its field only has one meaningful axis, therefore, spatial mapping of data onto a 2-dimensional field is both invalid and misleading. This paper presents two different visualizations for use in the analysis of American collegiate football data. The first provides an analysis of season-long data on a parallel coordinates chart, and the second presents a novel method of mapping football's 1-dimensional system using an arc diagram.",
    "doi":null,
    "outer_cite_count":null
  },
  {
    "key":"DJTEDHMT",
    "publication_name":"1st Workshop on Sports Data Visualization",
    "year":2013,
    "author_names":"Robert Sisneros;Mark Van Moer",
    "affiliations":null,
    "title":"Expanding Plus-Minus for Visual and Statistical Analysis of NBA Box-Score Data",
    "keywords":[
      "Visualization",
      "analytics",
      "basketball",
      "plus-minus",
      "numerical",
      "PluMP"
    ],
    "abstract":"In this work we present an augmentation of the plus-minus statistic as well as a new visual platform for exploring our derived values. Specifically, we apply the concept of measuring impact via differentials to all box score statistics and expand the focus of analysis from a player to a team. That is, on a per-game basis for a stat, we are concerned only with how many more or less than an opponent a team accumulates of that stat. We consider traditional plus-minus numbers at the team level as a measure of the quality of a win\/loss for a team; this creates several interesting opportunities for evaluating the impacts of player accomplishments numerically at the team level. We will detail PluMP, the plus-minus plot, and provide illuminating examples found in 2012-2013 NBA box score data. Further, we will provide a representative example of more general analysis that follows directly from our paradigm.",
    "doi":null,
    "outer_cite_count":null
  }
]